; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v2)
             (pred_4 ?v9 ?v4)
             (pred_2 ?v7 ?v4)
             (pred_6 ?v13 ?v7 )
	     (pred_10 ?v7)
             (pred_7 ?v11)
             (pred_11 ?v9)
             (pred_5 ?v4)
             (pred_1 ?v7)
             (pred_12 ?v9)
             (pred_9 ?v7)
             (pred_3 ))



(:action op_5
:parameters (?v12 ?v5 ?v10 ?v1)
:precondition (and (pred_7 ?v12) (pred_7 ?v5) (pred_11 ?v10) (pred_5 ?v1)
          (pred_8 ?v12 ?v5) (pred_4 ?v10 ?v1)
                   (pred_2 ?v5 ?v1) (pred_10 ?v12) 
                   (pred_1 ?v5) (pred_12 ?v10))
:effect (and  (pred_9 ?v5) (not (pred_1 ?v5))))


(:action op_3
:parameters (?v12 ?v8)
:precondition (and (pred_7 ?v12) (pred_7 ?v8)
               (pred_10 ?v12) (pred_8 ?v12 ?v8) (pred_9 ?v8))
:effect (and (pred_10 ?v8) (not (pred_10 ?v12))))

(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_7 ?v12) (pred_11 ?v10) 
                  (pred_10 ?v12) (pred_6 ?v10 ?v12) (pred_3 ))
:effect (and (pred_12 ?v10)
   (not (pred_6 ?v10 ?v12)) (not (pred_3 ))))


(:action op_4
:parameters (?v12 ?v6 ?v3)
:precondition (and (pred_7 ?v12) (pred_11 ?v6) (pred_11 ?v3)
                  (pred_10 ?v12) (pred_12 ?v3) (pred_6 ?v6 ?v12))
:effect (and (pred_12 ?v6) (pred_6 ?v3 ?v12)
        (not (pred_12 ?v3)) (not (pred_6 ?v6 ?v12))))

(:action op_1
:parameters (?v12 ?v10)
:precondition (and (pred_7 ?v12) (pred_11 ?v10) 
                  (pred_10 ?v12) (pred_12 ?v10))
:effect (and (pred_3 ) (pred_6 ?v10 ?v12) (not (pred_12 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_03 obj_15 obj_06 obj_21 obj_14 obj_12 obj_29 obj_04 obj_26 obj_25 obj_01 obj_05 obj_20 obj_28 obj_17 obj_07 obj_18 obj_24 obj_08 obj_10 obj_16 obj_27 obj_09 obj_22
    obj_23 obj_30
    obj_02 obj_11 obj_13
    )

    (:init
       (pred_3)

       (pred_7 obj_19)
       (pred_7 obj_03)
       (pred_7 obj_15)
       (pred_7 obj_06)
       (pred_7 obj_21)
       (pred_7 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_29)
       (pred_7 obj_04)
       (pred_7 obj_26)
       (pred_7 obj_25)
       (pred_7 obj_01)
       (pred_7 obj_05)
       (pred_7 obj_20)
       (pred_7 obj_28)
       (pred_7 obj_17)
       (pred_7 obj_07)
       (pred_7 obj_18)
       (pred_7 obj_24)
       (pred_7 obj_08)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_27)
       (pred_7 obj_09)
       (pred_7 obj_22)
       (pred_5 obj_23)
       (pred_5 obj_30)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_13)

       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_03)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_19)
       (pred_8 obj_15 obj_29)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_21)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_21 obj_26)
       (pred_8 obj_21 obj_06)
       (pred_8 obj_14 obj_25)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_29)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_29 obj_05)
       (pred_8 obj_29 obj_04)
       (pred_8 obj_29 obj_15)
       (pred_8 obj_29 obj_12)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_04 obj_26)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_29)
       (pred_8 obj_26 obj_28)
       (pred_8 obj_26 obj_21)
       (pred_8 obj_26 obj_04)
       (pred_8 obj_25 obj_17)
       (pred_8 obj_25 obj_01)
       (pred_8 obj_25 obj_14)
       (pred_8 obj_01 obj_07)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_25)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_05 obj_29)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_20 obj_24)
       (pred_8 obj_20 obj_28)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_28 obj_08)
       (pred_8 obj_28 obj_26)
       (pred_8 obj_28 obj_20)
       (pred_8 obj_17 obj_10)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_17 obj_25)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_07 obj_01)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_18 obj_27)
       (pred_8 obj_18 obj_24)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_24 obj_09)
       (pred_8 obj_24 obj_08)
       (pred_8 obj_24 obj_20)
       (pred_8 obj_24 obj_18)
       (pred_8 obj_08 obj_22)
       (pred_8 obj_08 obj_28)
       (pred_8 obj_08 obj_24)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_10 obj_17)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_27 obj_09)
       (pred_8 obj_27 obj_18)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_09 obj_22)
       (pred_8 obj_09 obj_24)
       (pred_8 obj_09 obj_27)
       (pred_8 obj_22 obj_08)
       (pred_8 obj_22 obj_09)
       (pred_1 obj_25)
       (pred_1 obj_04)
       (pred_1 obj_27)
       (pred_2  obj_25 obj_23)
       (pred_2  obj_04 obj_30)
       (pred_2  obj_27 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_03)
       (pred_9 obj_15)
       (pred_9 obj_06)
       (pred_9 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_12)
       (pred_9 obj_29)
       (pred_9 obj_26)
       (pred_9 obj_01)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_28)
       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_24)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_22)

       (pred_4  obj_02 obj_23)
       (pred_4  obj_11 obj_30)
       (pred_4  obj_13 obj_30)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_11 obj_22)
       (pred_6 obj_13 obj_03)
       (pred_10 obj_16)
    )

    (:goal (and
       (pred_6 obj_11 obj_29)
    ))
(:constraints
  (always (not (pred_10 obj_08)))
)
)

; plan
1. (op_3 obj_16 obj_07)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_07)
   goals met: 0 of 1
2. (op_3 obj_07 obj_18)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_18)
   goals met: 0 of 1
3. (op_3 obj_18 obj_24)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_24)
   goals met: 0 of 1
4. (op_3 obj_24 obj_09)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_09)
   goals met: 0 of 1
5. (op_3 obj_09 obj_22)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_22)
   goals met: 0 of 1
6. (op_2 obj_22 obj_11)
   deleted: (pred_6 obj_11 obj_22) (pred_3)
   added: (pred_12 obj_11)
   goals met: 0 of 1
7. (op_3 obj_22 obj_09)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_09)
   goals met: 0 of 1
8. (op_3 obj_09 obj_24)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_24)
   goals met: 0 of 1
9. (op_3 obj_24 obj_20)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_20)
   goals met: 0 of 1
10. (op_3 obj_20 obj_05)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_05)
   goals met: 0 of 1
11. (op_3 obj_05 obj_29)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_29)
   goals met: 0 of 1
12. (op_1 obj_29 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_3) (pred_6 obj_11 obj_29)
   goals met: 1 of 1
